[
    {
        "short_name": "Reflective Learning Chatbots",
        "route": "proj-rlchat",
        "project_duration": "Apr. 2022 - Apr. 2024",
        "text": "This is a Telegram chatbot framework created for the design and implementation of a variety of cognitive psychology experiments. Each of the experiments intends to prompt users to set goals and systematically reflect upon their progress towards those goals by regular interaction with the chatbot.<br/><br/>The framework allows for flexible implementation of several types of questions (e.g., free response, multiple choice, number input, etc.), multiple languages (Image 1), scheduled questions that appear at specific times depending on the user's timezone (Images 2 and 3), as well as custom variables to store and manipulate information. Implementation of an experiment requires no programming and is done entirely using JSON files.<br/><br/>This framework was built in collaboration with Dr. Falk Lieder and Dr. Ksenia Keplinger of the <a href='https://is.mpg.de/' target='_blank' class='link-url'>Max Planck Institute for Intelligent Systems</a> and was thoroughly tested and documented to remain stable and accessible to researchers in the future (see repository.)<br/><br/>This is my biggest and most thorough single programming project that spanned over a year. I hope you are impressed because I am proud of it :))",
        "header": "Reflective Learning Chatbots",
        "images": ["ChatbotWelcome.png", "ChatbotTimezone.png","ChatbotSchedule.png","ChatbotReflection.png","ChatbotLikert.png","ChatbotCommands.png"],
        "repository_url": ["https://www.github.com/RationalityEnhancement/ReflectiveLearningChatbots"],
        "tech_text": "Node.js (telegraf.js, jest), MongoDB, Heroku"
    },
    {
        "short_name": "Metacognitive Reinforcement Learning",
        "route": "proj-mcl",
        "project_duration": "Apr. 2022 - Apr. 2024",
        "text": "This was a computational cognitive psychology research project conducted by me under the supervision of Dr. Falk Lieder of the former research group <a href='https://re.is.mpg.de/' target='_blank' class='link-url'>Rationality Enhancement</a>, and submitted as the final thesis of my M.Sc. Cognitive Science studies at <a href='https://www.ikw.uni-osnabrueck.de/startseite.html' target='_blank' class='link-url'>Osnabrück University</a>.<br/><br/>We aimed to study the effects of two specific challenges - (1) scarcity of feedback and (2) misalignment of environment reward structure in the planning environment - on humans' ability to learn novel planning strategies by \"metacognitive reinforcement learning\" (Image 1).<br/><br/>Following data collection from two experiments (Images 2 and 3) and statistical hypothesis testing, we extended upon the previous research to implement concrete reinforcement learning models that propose brain mechanisms which best explain participant behaviour.<br/><br/>Results from the first experiment were published in the <a href='https://escholarship.org/uc/item/60x123xq' target='_blank' class='link-url'>45th Annual Conference of the Cognitive Science Society</a>. The entire project was written up in my <a href='https://drive.google.com/file/d/1W-TofHVM-ZQVpMNdrWotLcp2Y0qExGeP/view?usp=sharing' target='_blank' class='link-url'>Master thesis</a>",
        "header": "Hindering Factors of Metacognitive Reinforcement Learning",
        "images": ["MCRL-Schema.png", "MCRL-Scarcity.png", "MCRL-Misalignment.png"],
        "repository_url": ["https://www.github.com/srinidhisrinivas/mcl-scarcity-mouselab","https://www.github.com/srinidhisrinivas/mcl-misalignment-mouselab", "https://www.github.com/srinidhisrinivas/mcl-toolbox"],
        "tech_text": "jsPsych, Heroku, Python (PyTorch, statsmodels), psychology experiment design, data collection and processing, statistical data analysis/hypothesis testing, scientific writing"
    }
]
